app/Controllers/Spd.php

    public function formTambah(){
        if($this->request->isAJAX()){
            $id_st_personil = $this->request->getVar('id_st_personil');
            $row = $this->mSTPersonil->find($id_st_personil);

            $id_st = $this->request->getVar('id_st');
            $row_st = $this->mSuratTugas->find($id_st);
---
SELECT *
FROM `surat_tugas`
WHERE `surat_tugas`.`id_st` = '14'

                ];

                // var_dump($simpandata);
                $this->mSpd->insert($simpandata);
---
INSERT INTO `spd` (`nomor_spd`, `st_personil_id`, `kendaraan`, `tingkat_spd`, `sumber_dana`, `jenis_formulir`, `akun_anggaran`, `kota_ttd_spd`, `tanggal_ttd_spd`, `jabatan_ttd_spd`, `nama_ttd_spd`, `nip_ttd_spd`, `created_by`, `created_at`, `updated_at`) VALUES ('7/RT.02.01-SPD/3301/PPK-Kab/3301/2023', '62', 'Kendaraan', 'Tingkat C', 'APBN', 'SPD', '', 'Cilacap', '2023-03-07', 'Pejabat Pembuat Komitmen', 'Hari Sugiharto', '66', 1, '2023-03-07 21:21:08', '2023-03-07 21:21:08')

    public function cetak($id)
    {
        $row_spd = $this->mSpd->find(base64_decode($id));
        $row_person = $this->mSTPersonil->find($row_spd['st_personil_id']);
        $row_st = $this->mSuratTugas->find($row_person['surat_tugas_id']);
        $row_penandatangan = $this->mPenandatangan->first();
---
SELECT *
FROM `penandatangan`
 LIMIT 1