app/Controllers/Surattugas.php

SELECT COUNT(*) AS `numrows`
FROM `spd`
WHERE `st_personil_id` LIKE '%59%' ESCAPE '!'
SELECT *
FROM `spd`
WHERE `st_personil_id` = '59'
 LIMIT 1
---
    public function dataDetil(){
        if($this->request->isAJAX()){
            $id = $this->request->getVar('id');
            $row = $this->mSuratTugas->find($id);

            $st_personil = $this->mSTPersonil->like('surat_tugas_id' , $row['id_st'])->orderby('nama','ASC')->findAll();
            $isiPersonil = "<table class=\"table table-striped table-hover p-0 \">";
            foreach($st_personil as $personil):
                //cek apakah personil sudah dibuatkan SPD
                $cek_spd = $this->mSpd->like('st_personil_id', $personil['id_st_personil'])->countAllResults();

                if($cek_spd == 0){
                    $isiPersonil .= "
                                <tr>
                                    <td class=\"text-bold\">".$personil['nama']."</td>
                                    <td>".$personil['jabatan']."</td>
                                    <td><button type=\"button\" class=\"btn btn-sm btn-primary buatSpd\" onclick=\"buatSpd(". $personil['id_st_personil'].")\">Buat SPD</button></td>
                                </tr>
                                ";
                }else{
                    $row_spd = $this->mSpd->where('st_personil_id',$personil['id_st_personil'])->first();

SELECT *
FROM `surat_tugas`
WHERE `surat_tugas`.`id_st` = '14'
---
    public function cetak($id)
    {
        $row = $this->mSuratTugas->find(base64_decode($id));

        $date1=date_create($row['tanggal_berangkat']);
        $date2=date_create($row['tanggal_kembali']);
        $diff=date_diff($date1,$date2)->format('%d') ;

        $data = [
            'id' => $id,
            'jenis_st' => $row['jenis_st'],
            'instansi' => config('site')->instansi,
            'kabkota' => config('site')->kabkota,
            'ibukota' => config('site')->ibukota,
            'email' => config('site')->email,
            'website' => config('site')->website,
            'alamat' => config('site')->alamat,
            'nomor_st' => $row['nomor_st'],
            'template' => $this->mTemplate->findAll(),
            'dasar_st' => $row['dasar_st'],
            'st_personil' => $this->mSTPersonil->like('surat_tugas_id' , $row['id_st'])->findAll(),
            'st_personil_numrows' => $this->mSTPersonil->like('surat_tugas_id',$row['id_st'])->countAllResults(),
            'perihal_st' => $row['perihal_st'],
            'masa_tugas' => $diff+1,
            'tgl_st' => $row['tanggal_st'],
            'jabatan_ttd' => $row['jabatan_ttd'],
            'nama_ttd' => $row['nama_ttd'],
            'tgl_berangkat' => $row['tanggal_berangkat'],
            'tgl_kembali' => $row['tanggal_kembali'],

SELECT *
FROM `spd`
WHERE `st_personil_id` = '64'
DELETE FROM `spd`
WHERE `id_spd` IN ('22')
DELETE FROM `surat_tugas`
WHERE `id_st` IN ('15')
---
    public function hapusdata($id){
        if($this->request->isAJAX()){

            //hapus dulu surat tugas lokasi
            $r_lokasi = $this ->mSTLokasi ->like('surat_tugas_id', $id) ->findAll();
            foreach ($r_lokasi as $r_lok):
                $this->mSTLokasi ->delete($r_lok['id_st_lokasi']);
            endforeach;

            //hapus surat tugas personil & SPD
            $r_personil = $this->mSTPersonil ->like('surat_tugas_id', $id) ->findAll();
            foreach ($r_personil as $r_person):
                $r_spd = $this->mSpd->where('st_personil_id', $r_person['id_st_personil'])->findAll();
                foreach ( $r_spd as $r_spd):
                    $this->mSpd->delete($r_spd['id_spd']);
                endforeach;
                $this->mSTPersonil ->delete($r_person['id_st_personil']);