app/Models/SpdModel.php

SELECT *
FROM `spd`
WHERE `tanggal_ttd_spd` LIKE '%2023%' ESCAPE '!'
ORDER BY `id_spd` DESC
 LIMIT 1
---
    public function dataTerakhir()
    {
        return $this->db->table($this->table)
            ->like('tanggal_ttd_spd', date('Y'),'right')
            ->orderBy('id_spd','desc')
            ->limit(1)
            ->get()
            ->getRowArray();