app/Models/SuratTugasModel.php

SELECT *
FROM `surat_tugas`
WHERE `tanggal_st` LIKE '%2023%' ESCAPE '!'
ORDER BY `tanggal_st` DESC, `id_st` DESC
---
    public function selectByYear($year)
    {
        return $this->db->table($this->table)
            ->like('tanggal_st', $year, 'right')
            ->orderBy('tanggal_st', 'DESC')
            ->orderBy('id_st', 'DESC')
            ->get()
            ->getResultArray();